# StructuralConnectionApprovalType Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralConnectionApprovalType Class
Members See Also
---
A type element that represents a connection approval type.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class StructuralConnectionApprovalType : ElementType
```

Visual Basic
---
```text
Public Class StructuralConnectionApprovalType _
	Inherits ElementType
```

Visual C++
---
```text
public ref class StructuralConnectionApprovalType : public ElementType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB.Structure..::..StructuralConnectionApprovalType
# See Also
StructuralConnectionApprovalType Members
Autodesk.Revit.DB.Structure Namespace